БИТУправление_медицинским_центром_демо/src/Documents/ЗаявкаНаТехОбслуживание/ЗаявкаНаТехОбслуживание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТехОбслуживание</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаПриемки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.КомментарийДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принимающий</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбращения</name>
    <type>
      <types>CatalogRef.ТипыОбращений</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияИзменений</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Принимающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяДата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/ЗаявкаНаТехОбслуживание/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Не Отказ Тогда 
		Если НеобходимоЗаписатьИсториюИзменений() Тогда 
			ДобавитьЗаписьВИсториюИзменений();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	ИсторияИзменений.Очистить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьЗаписьВИсториюИзменений()
	
	СтрокаИсторияИзменений = ИсторияИзменений.Добавить();
	СтрокаИсторияИзменений.ДатаИзменения = ТекущаяДата();
	СтрокаИсторияИзменений.ПлановаяДата = ПлановаяДата;
	СтрокаИсторияИзменений.ФактическаяДата = ФактическаяДата;
	СтрокаИсторияИзменений.Исполнитель = Исполнитель;
	СтрокаИсторияИзменений.Принимающий = Принимающий;
	СтрокаИсторияИзменений.Ответственный = ОбщегоНазначения.ТекущийПользователь();
	СтрокаИсторияИзменений.Статус = Документы.ЗаявкаНаТехОбслуживание.ПолучитьСтатусЗаявки(ПлановаяДата, ФактическаяДата, ДатаПриемки); 
	
КонецПроцедуры

Функция НеобходимоЗаписатьИсториюИзменений()
	
	Если Ссылка.ПлановаяДата <> ПлановаяДата Или Ссылка.ФактическаяДата <> ФактическаяДата Или Ссылка.ДатаПриемки <> ДатаПриемки
		Или Ссылка.Исполнитель <> Исполнитель Или Ссылка.Принимающий <> Принимающий Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
